# AddCommandLink Method (TaskDialogCommandLinkId, String, String)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TaskDialog..::..AddCommandLink Method (TaskDialogCommandLinkId, String, String)
TaskDialog Class See Also
---
Adds a CommandLink associated to the given id, displaying the indicating main and supporting content.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public void AddCommandLink(
	TaskDialogCommandLinkId id,
	string mainContent,
	string supportingContent
)
```

Visual Basic
---
```text
Public Sub AddCommandLink ( _
	id As TaskDialogCommandLinkId, _
	mainContent As String, _
	supportingContent As String _
)
```

Visual C++
---
```text
public:
void AddCommandLink(
	TaskDialogCommandLinkId id,
	String^ mainContent,
	String^ supportingContent
)
```

# ### Parameters
id
    Type: Autodesk.Revit.UI..::..TaskDialogCommandLinkId The id of the CommandLink. This corresponds to the value returned by Show() when the link is chosen by the user.
mainContent
    Type: System..::..String The main content of the CommandLink.
supportingContent
    Type: System..::..String The main content of the CommandLink.
# Remarks
Parameter mainContent cannot contain newlines.
If the id has already been set to the task dialog, the new CommandLink definition overrides the old one.
CommandLinks will always be shown in the dialog in the order of their ids.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown when mainContent is nullNothingnullptra null reference (Nothing in Visual Basic). |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown when mainContent is an empty string. |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown when the mainContent contains newline characters. |

# See Also
TaskDialog Class
AddCommandLink Overload
Autodesk.Revit.UI Namespace